wiki/2016-09-13-BloomFilter–大规模数据处理利器(解决空查问题).html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>BloomFilter–大规模数据处理利器(解决空查问题)</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">BloomFilter–大规模数据处理利器(解决空查问题)</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#reprint"><div class="category">reprint</div></a> </div>
<div class="char-counter">2016-09-13</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd7c1dc4">BloomFilter–大规模数据处理利器</a></li>
<li><a href="#org9f974a8">实例</a></li>
<li><a href="#org0bba1d0">Bloom Filter的算法</a></li>
<li><a href="#org73a51e8">Bloom Filter参数选择</a></li>
<li><a href="#org09a591c">Bloom Filter实现代码（简易版）</a></li>
<li><a href="#org380db97">Bloom Filter的优点及应用。</a>
<ul>
<li><a href="#org8a3c4c7">优缺点分析</a>
<ul>
<li><a href="#orgfe47aed">优点：</a></li>
<li><a href="#orgf4aef9d">缺点：</a></li>
</ul>
</li>
<li><a href="#org122e39e">使用场景</a></li>
</ul>
</li>
<li><a href="#org7a72dd9">实施方案思考</a></li>
<li><a href="#org572393f">Bloom Fitler C 语言实现</a>
<ul>
<li><a href="#org20d70dd">This program is a code dump.</a></li>
<li><a href="#orgb954028">SOURCE</a>
<ul>
<li><a href="#org0cf4fde">bloom.h</a></li>
<li><a href="#org6459273">bloom.c</a></li>
<li><a href="#org06f9760">test.c</a></li>
<li><a href="#orgf82512a">Makefile</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6d83932">Bloom Filter Java 语言实现</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgd7c1dc4" class="outline-2">
<h2 id="orgd7c1dc4">BloomFilter–大规模数据处理利器</h2>
<div class="outline-text-2" id="text-orgd7c1dc4">
<p>
Bloom Filter是由Bloom在1970年提出的一种多哈希函数映射的快速查找算法。
通常应用在一些需要快速判断某个元素是否属于集合，但是并不严格要求100%正
确的场合。
</p>
</div>
</div>

<div id="outline-container-org9f974a8" class="outline-2">
<h2 id="org9f974a8">实例</h2>
<div class="outline-text-2" id="text-org9f974a8">
<p>
为了说明Bloom Filter存在的重要意义，举一个实例：
</p>

<p>
假设要你写一个网络爬虫程序（web crawler）。由于网络间的链接错综复杂，
爬虫在网络间爬行很可能会形成“环”。为了避免形成“环”，就需要知道爬虫程序
已经访问过那些URL。给一个URL，怎样知道爬虫程序是否已经访问过呢？稍微想
想，就会有如下几种方案：
</p>

<ol class="org-ol">
<li>将访问过的URL保存到数据库。</li>
<li>用HashSet将访问过的URL保存起来。那只需接近O(1)的代价就可以查到一个URL是否被访问过了。</li>
<li>URL经过MD5或SHA-1等单向哈希后再保存到HashSet或数据库。</li>
<li>Bit-Map方法。建立一个BitSet，将每个URL经过一个哈希函数映射到某一位。</li>
</ol>

<p>
方法1~3都是将访问过的URL完整保存，方法4则只标记URL的一个映射位。
</p>

<p>
以上方法在数据量较小的情况下都能完美解决问题，但是当数据量变得非常庞大
时问题就来了。
</p>

<p>
方法1的缺点：数据量变得非常庞大后关系型数据库查询的效率会变得很低。而
且每来一个URL就启动一次数据库查询是不是太小题大做了？
</p>

<p>
方法2的缺点：太消耗内存。随着URL的增多，占用的内存会越来越多。就算只有
1亿个URL，每个URL只算50个字符，就需要5GB内存。
</p>

<p>
方法3：由于字符串经过MD5处理后的信息摘要长度只有128Bit，SHA-1处理后也
只有160Bit，因此方法3比方法2节省了好几倍的内存。
</p>

<p>
方法4消耗内存是相对较少的，但缺点是单一哈希函数发生冲突的概率太高。还
记得数据结构课上学过的Hash表冲突的各种解决方法么？若要降低冲突发生的概
率到1%，就要将BitSet的长度设置为URL个数的100倍。
</p>
</div>
</div>

<div id="outline-container-org0bba1d0" class="outline-2">
<h2 id="org0bba1d0">Bloom Filter的算法</h2>
<div class="outline-text-2" id="text-org0bba1d0">
<p>
废话说到这里，下面引入本篇的主角–Bloom Filter。其实上面方法4的思想已经
很接近Bloom Filter了。方法四的致命缺点是冲突概率高，为了降低冲突的概念，
Bloom Filter使用了多个哈希函数，而不是一个。
</p>

<p>
Bloom Filter算法如下：
</p>

<p>
创建一个m位BitSet，先将所有位初始化为0，然后选择k个不同的哈希函数。第i
个哈希函数对字符串str哈希的结果记为h（i，str），且h（i，str）的范围是0
到m-1 。
</p>

<ol class="org-ol">
<li><p>
加入字符串过程
下面是每个字符串处理的过程，首先是将字符串str“记录”到BitSet中的过程：
</p>
<blockquote>
<p>
   对于字符串str，分别计算h（1，str），h（2，str）…… h（k，str）。然后
将BitSet的第h（1，str）、h（2，str）…… h（k，str）位设为1。
</p>
</blockquote>
<p>
很简单吧？这样就将字符串str映射到BitSet中的k个二进制位了。
</p></li>

<li><p>
检查字符串是否存在的过程
下面是检查字符串str是否被BitSet记录过的过程：
</p>
<blockquote>
<p>
   对于字符串str，分别计算h（1，str），h（2，str）…… h（k，str）。然后
检查BitSet的第h（1，str）、h（2，str）…… h（k，str）位是否为1，若其中
任何一位不为1则可以判定str一定没有被记录过。若全部位都是1，则“认为”字
符串str存在。
</p>

<p>
若一个字符串对应的Bit不全为1，则可以肯定该字符串一定没有被Bloom
Filter记录过。（这是显然的，因为字符串被记录过，其对应的二进制位肯定全
部被设为1了）
</p>

<p>
但是若一个字符串对应的Bit全为1，实际上是不能100%的肯定该字符串被
Bloom Filter记录过的。（因为有可能该字符串的所有位都刚好是被其他字符串
所对应）这种将该字符串划分错的情况，称为false positive 。
</p>
</blockquote></li>
<li><p>
删除字符串过程
</p>

<p>
字符串加入了就被不能删除了，因为删除会影响到其他字符串。实在需要删
除字符串的可以使用Counting bloomfilter(CBF)，这是一种基本Bloom
Filter的变体，CBF将基本Bloom Filter每一个Bit改为一个计数器，这样就
可以实现删除字符串的功能了。　Bloom Filter跟单哈希函数Bit-Map不同之
处在于：Bloom Filter使用了k个哈希函数，每个字符串跟k个bit对应。从而
降低了冲突的概率。
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org73a51e8" class="outline-2">
<h2 id="org73a51e8">Bloom Filter参数选择</h2>
<div class="outline-text-2" id="text-org73a51e8">
<ol class="org-ol">
<li>哈希函数选择
哈希函数的选择对性能的影响应该是很大的，一个好的哈希函数要能近似等
概率的将字符串映射到各个Bit。选择k个不同的哈希函数比较麻烦，一种简
单的方法是选择一个哈希函数，然后送入k个不同的参数。</li>

<li><p>
m,n,k值，我们如何取值
我们定义：
</p>
<ol class="org-ol">
<li>可能把不属于这个集合的元素误认为属于这个集合（False Positive）</li>
<li>不会把属于这个集合的元素误认为不属于这个集合（False Negative）。</li>
</ol>

<p>
哈希函数的个数k、位数组大小m、加入的字符串数量n的关系。哈希函数个数k
取10，位数组大小m设为字符串个数n的20倍时，false positive发生的概率
是0.0000889 ，即10万次的判断中，会存在9次误判，对于一天1亿次的查询，
误判的次数为9000次。
</p>

<p>
算法分析：
</p>
<blockquote>
<p>
我们假设kn&lt;m且各个哈希函数是完全随机的。当集合S={x1, x2,…,xn}的所有
元素都被k个哈希函数映射到m位的位数组中时，这个位数组中某一位还是0的
概率是：
</p>

<p>
False Positive的概率是：
</p>
<ol class="org-ol">
<li>p’表示1的概率,k次方表示8次hash都为1的概率。</li>
<li>当 k = ln 2 * m/n 时，右边的等式值最小，此时等式转变成:
(1/2)<sup>k</sup> = (0.6185)<sup>(m/2)</sup></li>
</ol>
</blockquote></li>
</ol>
</div>
</div>
