wiki/2016-09-13-BloomFilter–大规模数据处理利器(解决空查问题).html

<div id="outline-container-org09a591c" class="outline-2">
<h2 id="org09a591c">Bloom Filter实现代码（简易版）</h2>
<div class="outline-text-2" id="text-org09a591c">
<p>
下面给出一个简单的Bloom Filter的Java实现代码：
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">package</span> org.magnus.<span style="font-weight: bold; text-decoration: underline;">utils</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">BitSet</span>;
<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#20256;&#32479;&#30340;Bloom filter &#19981;&#25903;&#25345;&#20174;&#38598;&#21512;&#20013;&#21024;&#38500;&#25104;&#21592;&#12290;</span>
<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Counting Bloom filter&#30001;&#20110;&#37319;&#29992;&#20102;&#35745;&#25968;&#65292;&#22240;&#27492;&#25903;&#25345;remove&#25805;&#20316;&#12290;</span>
<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#22522;&#20110;BitSet&#26469;&#23454;&#29616;&#65292;&#24615;&#33021;&#19978;&#21487;&#33021;&#23384;&#22312;&#38382;&#39064;</span>
<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">SimpleBloomFilter</span> {
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">DEFAULT_SIZE&#20026;2&#30340;25&#27425;&#26041;</span>
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">final</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">DEFAULT_SIZE</span> = 2 &lt;&lt; 24;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">&#19981;&#21516;&#21704;&#24076;&#20989;&#25968;&#30340;&#31181;&#23376;&#65292;&#19968;&#33324;&#24212;&#21462;&#36136;&#25968;,seeds&#25968;&#25454;&#20849;&#26377;7&#20010;&#20540;&#65292;&#21017;&#20195;&#34920;&#37319;&#29992;7&#31181;&#19981;&#21516;&#30340;HASH&#31639;&#27861; */</span>
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">final</span> <span style="font-weight: bold; text-decoration: underline;">int</span>[] <span style="font-weight: bold; font-style: italic;">seeds</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">int</span>[] { 5, 7, 11, 13, 31, 37, 61 };
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">BitSet&#23454;&#38469;&#26159;&#30001;&#8220;&#20108;&#36827;&#21046;&#20301;&#8221;&#26500;&#25104;&#30340;&#19968;&#20010;Vector&#12290;&#20551;&#22914;&#24076;&#26395;&#39640;&#25928;&#29575;&#22320;&#20445;&#23384;&#22823;&#37327;&#8220;&#24320;&#65293;&#20851;&#8221;&#20449;&#24687;&#65292;&#23601;&#24212;&#20351;&#29992;BitSet.</span>
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">BitSet&#30340;&#26368;&#23567;&#38271;&#24230;&#26159;&#19968;&#20010;&#38271;&#25972;&#25968;&#65288;Long&#65289;&#30340;&#38271;&#24230;&#65306;64&#20301;</span>
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">BitSet</span> <span style="font-weight: bold; font-style: italic;">bits</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BitSet</span>(DEFAULT_SIZE);
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">&#21704;&#24076;&#20989;&#25968;&#23545;&#35937; */</span>
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">SimpleHash</span>[] <span style="font-weight: bold; font-style: italic;">func</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">SimpleHash</span>[seeds.length];

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>) {
       <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">value</span> = <span style="font-style: italic;">"stone2083@yahoo.cn"</span>;
       <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#23450;&#20041;&#19968;&#20010;filter&#65292;&#23450;&#20041;&#30340;&#26102;&#20505;&#20250;&#35843;&#29992;&#26500;&#36896;&#20989;&#25968;&#65292;&#21363;&#21021;&#22987;&#21270;&#19971;&#20010;hash&#20989;&#25968;&#23545;&#35937;&#25152;&#38656;&#35201;&#30340;&#20449;&#24687;&#12290;</span>
       <span style="font-weight: bold; text-decoration: underline;">SimpleBloomFilter</span> <span style="font-weight: bold; font-style: italic;">filter</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">SimpleBloomFilter</span>();
       <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#21028;&#26029;&#26159;&#21542;&#21253;&#21547;&#22312;&#37324;&#38754;&#12290;&#22240;&#20026;&#27809;&#26377;&#35843;&#29992;add&#26041;&#27861;&#65292;&#25152;&#20197;&#32943;&#23450;&#26159;&#36820;&#22238;false</span>
       System.out.println(filter.contains(value));
       filter.add(value);
       System.out.println(filter.contains(value));
    }
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#26500;&#36896;&#20989;&#25968;</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">SimpleBloomFilter</span>() {
       <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; seeds.<span style="font-weight: bold; text-decoration: underline;">length</span>; i++) {
           <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#32473;&#20986;&#25152;&#26377;&#30340;hash&#20540;&#65292;&#20849;&#35745;seeds.length&#20010;hash&#20540;&#12290;&#20849;7&#20301;&#12290;</span>
           <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#36890;&#36807;&#35843;&#29992;SimpleHash.hash(),&#21487;&#20197;&#24471;&#21040;&#26681;&#25454;7&#31181;hash&#20989;&#25968;&#35745;&#31639;&#24471;&#20986;&#30340;hash&#20540;&#12290;</span>
           <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#20256;&#20837;DEFAULT_SIZE(&#26368;&#32456;&#23383;&#31526;&#20018;&#30340;&#38271;&#24230;&#65289;&#65292;seeds[i](&#19968;&#20010;&#25351;&#23450;&#30340;&#36136;&#25968;)&#21363;&#21487;&#24471;&#21040;&#38656;&#35201;&#30340;&#37027;&#20010;hash&#20540;&#30340;&#20301;&#32622;&#12290;</span>
           func[i] = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">SimpleHash</span>(DEFAULT_SIZE, seeds[i]);
       }
    }

    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#23558;&#23383;&#31526;&#20018;&#26631;&#35760;&#21040;bits&#20013;&#65292;&#21363;&#35774;&#32622;&#23383;&#31526;&#20018;&#30340;7&#20010;hash&#20540;&#20989;&#25968;&#20026;1</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">add</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">value</span>) {
       <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">SimpleHash</span> <span style="font-weight: bold; font-style: italic;">f</span> : func) {
           bits.set(f.hash(value), <span style="font-weight: bold; text-decoration: underline;">true</span>);
       }
    }

    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#21028;&#26029;&#23383;&#31526;&#20018;&#26159;&#21542;&#24050;&#32463;&#34987;bits&#26631;&#35760;</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">boolean</span> <span style="font-weight: bold;">contains</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">value</span>) {
       <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#30830;&#20445;&#20256;&#20837;&#30340;&#19981;&#26159;&#31354;&#20540;</span>
       <span style="font-weight: bold;">if</span> (value == <span style="font-weight: bold; text-decoration: underline;">null</span>) {
           <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">false</span>;
       }
       <span style="font-weight: bold; text-decoration: underline;">boolean</span> <span style="font-weight: bold; font-style: italic;">ret</span> = <span style="font-weight: bold; text-decoration: underline;">true</span>;
       <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35745;&#31639;7&#31181;hash&#31639;&#27861;&#19979;&#21508;&#33258;&#23545;&#24212;&#30340;hash&#20540;&#65292;&#24182;&#21028;&#26029;</span>
       <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">SimpleHash</span> <span style="font-weight: bold; font-style: italic;">f</span> : func) {
           <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&amp;&amp;&#26159;boolen&#36816;&#31639;&#31526;&#65292;&#21482;&#35201;&#26377;&#19968;&#20010;&#20026;0&#65292;&#21017;&#20026;0&#12290;&#21363;&#38656;&#35201;&#25152;&#26377;&#30340;&#20301;&#37117;&#20026;1&#65292;&#25165;&#20195;&#34920;&#21253;&#21547;&#22312;&#37324;&#38754;&#12290;</span>
           <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">f.hash(value)&#36820;&#22238;hash&#23545;&#24212;&#30340;&#20301;&#25968;&#20540;</span>
           <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">bits.get&#20989;&#25968;&#36820;&#22238;bitset&#20013;&#23545;&#24212;position&#30340;&#20540;&#12290;&#21363;&#36820;&#22238;hash&#20540;&#26159;&#21542;&#20026;0&#25110;1&#12290;</span>
           ret = ret &amp;&amp; bits.get(f.hash(value));
       }
       <span style="font-weight: bold;">return</span> ret;
    }
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">&#21704;&#24076;&#20989;&#25968;&#31867; */</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">SimpleHash</span> {
       <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">cap&#20026;DEFAULT_SIZE&#30340;&#20540;&#65292;&#21363;&#29992;&#20110;&#32467;&#26524;&#30340;&#26368;&#22823;&#30340;&#23383;&#31526;&#20018;&#38271;&#24230;&#12290;</span>
       <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">seed&#20026;&#35745;&#31639;hash&#20540;&#30340;&#19968;&#20010;&#32473;&#23450;key&#65292;&#20855;&#20307;&#23545;&#24212;&#19978;&#38754;&#23450;&#20041;&#30340;seeds&#25968;&#32452;</span>
       <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">cap</span>;
       <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">seed</span>;

       <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">SimpleHash</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">cap</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">seed</span>) {
           <span style="font-weight: bold;">this</span>.cap = cap;
           <span style="font-weight: bold;">this</span>.seed = seed;
       }

       <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35745;&#31639;hash&#20540;&#30340;&#20855;&#20307;&#31639;&#27861;,hash&#20989;&#25968;&#65292;&#37319;&#29992;&#31616;&#21333;&#30340;&#21152;&#26435;&#21644;hash</span>
       <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">hash</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">value</span>) {
           <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">int&#30340;&#33539;&#22260;&#26368;&#22823;&#26159;2&#30340;31&#27425;&#26041;&#20943;1&#65292;&#25110;&#36229;&#36807;&#20540;&#21017;&#29992;&#36127;&#25968;&#26469;&#34920;&#31034;</span>
           <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">result</span> = 0;
           <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">len</span> = value.length();
           <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; <span style="font-weight: bold; text-decoration: underline;">len</span>; i++) {
              <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#25968;&#23383;&#21644;&#23383;&#31526;&#20018;&#30456;&#21152;&#65292;&#23383;&#31526;&#20018;&#36716;&#25442;&#25104;&#20026;ASCII&#30721;</span>
              result = seed * result + value.charAt(i);
              <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">System.out.println(result+"--"+seed+"*"+result+"+"+value.charAt(i));</span>
           }
       <span style="font-weight: bold; font-style: italic;">//  </span><span style="font-weight: bold; font-style: italic;">System.out.println("result="+result+";"+((cap - 1) &amp; result));</span>
       <span style="font-weight: bold; font-style: italic;">//  </span><span style="font-weight: bold; font-style: italic;">System.out.println(414356308*61+'h');  &#25191;&#34892;&#27492;&#36816;&#31639;&#32467;&#26524;&#20026;&#36127;&#25968;&#65292;&#20026;&#20160;&#20040;&#65311;</span>
           <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&amp;&#26159;java&#20013;&#30340;&#20301;&#36923;&#36753;&#36816;&#31639;&#65292;&#29992;&#20110;&#36807;&#28388;&#36127;&#25968;&#65288;&#36127;&#25968;&#19982;&#36827;&#31639;&#36716;&#25442;&#25104;&#21453;&#30721;&#36827;&#34892;&#65289;&#12290;</span>
           <span style="font-weight: bold;">return</span> (cap - 1) &amp; result;
       }
    }
}
</pre>
</div>
</div>
</div>
