_src/wiki/2016-09-13-BloomFilter–大规模数据处理利器(解决空查问题).org
* Bloom Filter的优点及应用。
** 优缺点分析
*** 优点：
节约缓存空间（空值的映射），不再需要空值映射。
减少数据库或缓存的请求次数。
提升业务的处理效率以及业务隔离性。

*** 缺点：
存在误判的概率。
传统的Bloom Filter不能作删除操作。

** 使用场景
适用于特定场景，能够有效的解决数据库空查问题。以公司的某小表查询为例，
该表每天查询量20亿次左右，且数据库中存在大量的下面的空查:目前表中的记
录为8w,即n的值为8w, m=20*n=160w，占用空间大小195KB。以type||CONTENT复
合键作为key值，假设HASH次数k取值为6,误判率为:0.0303%(10000次中存在3次
误判)。HASH次数的最优解为14，当k=14时，误判率为：0.014%(10000次中存在
1-2次误判)。测试过程及结果如下（源代码见附件）：

1. 测试场景1：
   1) 参数：
      m=1600000;n=80000;最优解k=14;m/n=20;k的次数为:6;对1000w数据进行判定:
   2) 测试结果：
      2000w数据误判的记录为：3035，误判率约为0.03035%（和理
      论值0.0303%相差不大）。判断2000万数据的时间为25秒。平均一次判断
      时间为:2.5微秒。平均一次hash时间为0.417微秒。
2. 测试场景2：
   1) 参数：
      m=1600000;n=80000;最优解k=14;m/n=20;k的次数为:6;对2000w数据进行判定:
   2) 测试结果：
      2000w数据误判的记录为：5839，误判率约为0.029%（理论值为0. 0303%）。
      判断1000万数据的时间为51秒。平均一次判断时间为:2.55微秒。平均一
      次hash时间为0.425微秒。
3. 测试场景3：
   1) 参数：
      m=1600000;n=80000;最优解k=14;m/n=20;k的次数为:14;对1000w数据进行判定 :
   2) 测试结果：
      1000w数据误判的记录为：605，误判率约为0.00605%（和理论值0. 014%
      相差不大）。判断1000万数据的时间为37秒。平均一次判断时间为:3.7微秒。
      平均一次hash时间为0.265微秒。
4. 测试场景4：
   1) 参数：
      m=1600000;n=80000;最优解k=14;m/n=20;k的次数为:14;对2000w数据进行判定:
   2) 测试结果：
      2000w数据误判的记录为：1224，误判率约为0.00612%（理论值为0.014%）。
      判断1000万数据的时间为84秒。平均一次判断时间为:4.2微秒。
      平均一次hash时间为0.3微秒。
5. 其它测试略。


结论:

| 测试 | m/n | K（括号内为最优解） | 数据基数 |  误判数 |   误判率 |  理论值 | 用时（单位：秒） | 一次判定时间(单位：微秒) | 一次Hash时间(单位：微秒.估参考) |
|------+-----+---------------------+----------+---------+----------+---------+------------------+--------------------------+---------------------------------|
|    1 |  20 |               6(14) | 1000W    |    3035 | 0.03035% | 0.0303% |               25 |                      2.5 |                           0.417 |
|    2 |  20 |               6(14) | 2000W    |    5839 |   0.029% | 0.0303% |               51 |                     2.55 |                           0.425 |
|    3 |  20 |              14(14) | 1000W    |     605 | 0.00605% |  0.014% |               37 |                      3.7 |                           0.265 |
|    4 |  20 |              14(14) | 2000W    |    1224 | 0.00612% |  0.014% |               84 |                      4.2 |                             0.3 |
|    5 |  20 |              20(14) | 1000W    |     914 | 0.00914% |  不计算 |               48 |                      4.8 |                            0.24 |
|    6 |  20 |              20(14) | 2000W    |    1881 | 0.00941% |  不计算 |               99 |                     4.95 |                          0.2475 |
|    7 |  10 |              7（7） | 1000w    |  517854 |   0.786% |  0.819% |               41 |                      4.1 |                            0.59 |
|    8 |   5 |              3（3） | 1000w    |  901411 |   9.014% |    9.2% |               31 |                      3.1 |                           1.033 |
|    9 |   2 |                1(1) | 1000w    | 3910726 |  39.107% |   39.3% |               29 |                      2.9 |                             2.9 |
|   10 |   2 |                2(1) | 1000w    | 3961065 |   39.61% |     40% |               30 |                      3.0 |                             3.0 |
|   11 |   2 |                5(1) | 1000w    | 6436696 |   64.37% |  不计算 |               76 |                      7.6 |                            1.52 |

一次判断时间计算方式为：总时间/总次数 \\
一次HASH所需时间计算方式为：一次判定时间/每次判断需要的hash数。\\
一次HASH所需时间，当执行hash次数越少，基数越小，误差越大。当一次判断所需的hash次数越大时，一次hash时间越精确。

结论：

m/n的比值越大越好，比较越大，误判率会越代，但同时会使用更多的空间成本。
Hash次数增加带来的收益并不大。需要在条件允许的情况下，尽量的扩大m/n的值。

* 实施方案思考
适用于一些黑名单,垃圾邮件等的过滤。

当位数组较小时，可以作本地jvm缓存。

当位数组较大时，可以做基于tair的缓存，此时可能需要开辟单独的应用来提供查询支持。

此方案，适用的应用场景需要能够容忍，位数组和的延时。


* Bloom Fitler C 语言实现
** This program is a code dump.
 Code dumps are articles with little or no documentation or
 rearrangement of code. Please help to turn it into a literate
 program. Also make sure that the source of this code does consent to
 release it under the CC0 license.

 This is an implementation of a Bloom filter in C.
** SOURCE
