wiki/2016-09-13-BloomFilter–大规模数据处理利器(解决空查问题).html

<div id="outline-container-org380db97" class="outline-2">
<h2 id="org380db97">Bloom Filter的优点及应用。</h2>
<div class="outline-text-2" id="text-org380db97">
</div>
<div id="outline-container-org8a3c4c7" class="outline-3">
<h3 id="org8a3c4c7">优缺点分析</h3>
<div class="outline-text-3" id="text-org8a3c4c7">
</div>
<div id="outline-container-orgfe47aed" class="outline-4">
<h4 id="orgfe47aed">优点：</h4>
<div class="outline-text-4" id="text-orgfe47aed">
<p>
节约缓存空间（空值的映射），不再需要空值映射。
减少数据库或缓存的请求次数。
提升业务的处理效率以及业务隔离性。
</p>
</div>
</div>

<div id="outline-container-orgf4aef9d" class="outline-4">
<h4 id="orgf4aef9d">缺点：</h4>
<div class="outline-text-4" id="text-orgf4aef9d">
<p>
存在误判的概率。
传统的Bloom Filter不能作删除操作。
</p>
</div>
</div>
</div>

<div id="outline-container-org122e39e" class="outline-3">
<h3 id="org122e39e">使用场景</h3>
<div class="outline-text-3" id="text-org122e39e">
<p>
适用于特定场景，能够有效的解决数据库空查问题。以公司的某小表查询为例，
该表每天查询量20亿次左右，且数据库中存在大量的下面的空查:目前表中的记
录为8w,即n的值为8w, m=20*n=160w，占用空间大小195KB。以type||CONTENT复
合键作为key值，假设HASH次数k取值为6,误判率为:0.0303%(10000次中存在3次
误判)。HASH次数的最优解为14，当k=14时，误判率为：0.014%(10000次中存在
1-2次误判)。测试过程及结果如下（源代码见附件）：
</p>

<ol class="org-ol">
<li>测试场景1：
<ol class="org-ol">
<li>参数：
m=1600000;n=80000;最优解k=14;m/n=20;k的次数为:6;对1000w数据进行判定:</li>
<li>测试结果：
2000w数据误判的记录为：3035，误判率约为0.03035%（和理
论值0.0303%相差不大）。判断2000万数据的时间为25秒。平均一次判断
时间为:2.5微秒。平均一次hash时间为0.417微秒。</li>
</ol></li>
<li>测试场景2：
<ol class="org-ol">
<li>参数：
m=1600000;n=80000;最优解k=14;m/n=20;k的次数为:6;对2000w数据进行判定:</li>
<li>测试结果：
2000w数据误判的记录为：5839，误判率约为0.029%（理论值为0. 0303%）。
判断1000万数据的时间为51秒。平均一次判断时间为:2.55微秒。平均一
次hash时间为0.425微秒。</li>
</ol></li>
<li>测试场景3：
<ol class="org-ol">
<li>参数：
m=1600000;n=80000;最优解k=14;m/n=20;k的次数为:14;对1000w数据进行判定 :</li>
<li>测试结果：
1000w数据误判的记录为：605，误判率约为0.00605%（和理论值0. 014%
相差不大）。判断1000万数据的时间为37秒。平均一次判断时间为:3.7微秒。
平均一次hash时间为0.265微秒。</li>
</ol></li>
<li>测试场景4：
<ol class="org-ol">
<li>参数：
m=1600000;n=80000;最优解k=14;m/n=20;k的次数为:14;对2000w数据进行判定:</li>
<li>测试结果：
2000w数据误判的记录为：1224，误判率约为0.00612%（理论值为0.014%）。
判断1000万数据的时间为84秒。平均一次判断时间为:4.2微秒。
平均一次hash时间为0.3微秒。</li>
</ol></li>
<li>其它测试略。</li>
</ol>


<p>
结论:
</p>

<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">测试</th>
<th scope="col" class="org-right">m/n</th>
<th scope="col" class="org-right">K（括号内为最优解）</th>
<th scope="col" class="org-left">数据基数</th>
<th scope="col" class="org-right">误判数</th>
<th scope="col" class="org-right">误判率</th>
<th scope="col" class="org-right">理论值</th>
<th scope="col" class="org-right">用时（单位：秒）</th>
<th scope="col" class="org-right">一次判定时间(单位：微秒)</th>
<th scope="col" class="org-right">一次Hash时间(单位：微秒.估参考)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">20</td>
<td class="org-right">6(14)</td>
<td class="org-left">1000W</td>
<td class="org-right">3035</td>
<td class="org-right">0.03035%</td>
<td class="org-right">0.0303%</td>
<td class="org-right">25</td>
<td class="org-right">2.5</td>
<td class="org-right">0.417</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">20</td>
<td class="org-right">6(14)</td>
<td class="org-left">2000W</td>
<td class="org-right">5839</td>
<td class="org-right">0.029%</td>
<td class="org-right">0.0303%</td>
<td class="org-right">51</td>
<td class="org-right">2.55</td>
<td class="org-right">0.425</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">20</td>
<td class="org-right">14(14)</td>
<td class="org-left">1000W</td>
<td class="org-right">605</td>
<td class="org-right">0.00605%</td>
<td class="org-right">0.014%</td>
<td class="org-right">37</td>
<td class="org-right">3.7</td>
<td class="org-right">0.265</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">20</td>
<td class="org-right">14(14)</td>
<td class="org-left">2000W</td>
<td class="org-right">1224</td>
<td class="org-right">0.00612%</td>
<td class="org-right">0.014%</td>
<td class="org-right">84</td>
<td class="org-right">4.2</td>
<td class="org-right">0.3</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">20</td>
<td class="org-right">20(14)</td>
<td class="org-left">1000W</td>
<td class="org-right">914</td>
<td class="org-right">0.00914%</td>
<td class="org-right">不计算</td>
<td class="org-right">48</td>
<td class="org-right">4.8</td>
<td class="org-right">0.24</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">20</td>
<td class="org-right">20(14)</td>
<td class="org-left">2000W</td>
<td class="org-right">1881</td>
<td class="org-right">0.00941%</td>
<td class="org-right">不计算</td>
<td class="org-right">99</td>
<td class="org-right">4.95</td>
<td class="org-right">0.2475</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">10</td>
<td class="org-right">7（7）</td>
<td class="org-left">1000w</td>
<td class="org-right">517854</td>
<td class="org-right">0.786%</td>
<td class="org-right">0.819%</td>
<td class="org-right">41</td>
<td class="org-right">4.1</td>
<td class="org-right">0.59</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">5</td>
<td class="org-right">3（3）</td>
<td class="org-left">1000w</td>
<td class="org-right">901411</td>
<td class="org-right">9.014%</td>
<td class="org-right">9.2%</td>
<td class="org-right">31</td>
<td class="org-right">3.1</td>
<td class="org-right">1.033</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">2</td>
<td class="org-right">1(1)</td>
<td class="org-left">1000w</td>
<td class="org-right">3910726</td>
<td class="org-right">39.107%</td>
<td class="org-right">39.3%</td>
<td class="org-right">29</td>
<td class="org-right">2.9</td>
<td class="org-right">2.9</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">2</td>
<td class="org-right">2(1)</td>
<td class="org-left">1000w</td>
<td class="org-right">3961065</td>
<td class="org-right">39.61%</td>
<td class="org-right">40%</td>
<td class="org-right">30</td>
<td class="org-right">3.0</td>
<td class="org-right">3.0</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-right">2</td>
<td class="org-right">5(1)</td>
<td class="org-left">1000w</td>
<td class="org-right">6436696</td>
<td class="org-right">64.37%</td>
<td class="org-right">不计算</td>
<td class="org-right">76</td>
<td class="org-right">7.6</td>
<td class="org-right">1.52</td>
</tr>
</tbody>
</table>

<p>
一次判断时间计算方式为：总时间/总次数 <br>
一次HASH所需时间计算方式为：一次判定时间/每次判断需要的hash数。<br>
一次HASH所需时间，当执行hash次数越少，基数越小，误差越大。当一次判断所需的hash次数越大时，一次hash时间越精确。
</p>

<p>
结论：
</p>

<p>
m/n的比值越大越好，比较越大，误判率会越代，但同时会使用更多的空间成本。
Hash次数增加带来的收益并不大。需要在条件允许的情况下，尽量的扩大m/n的值。
</p>
</div>
</div>
</div>

<div id="outline-container-org7a72dd9" class="outline-2">
<h2 id="org7a72dd9">实施方案思考</h2>
<div class="outline-text-2" id="text-org7a72dd9">
<p>
适用于一些黑名单,垃圾邮件等的过滤。
</p>

<p>
当位数组较小时，可以作本地jvm缓存。
</p>

<p>
当位数组较大时，可以做基于tair的缓存，此时可能需要开辟单独的应用来提供查询支持。
</p>

<p>
此方案，适用的应用场景需要能够容忍，位数组和的延时。
</p>
</div>
</div>


<div id="outline-container-org572393f" class="outline-2">
<h2 id="org572393f">Bloom Fitler C 语言实现</h2>
<div class="outline-text-2" id="text-org572393f">
</div>
<div id="outline-container-org20d70dd" class="outline-3">
<h3 id="org20d70dd">This program is a code dump.</h3>
<div class="outline-text-3" id="text-org20d70dd">
<p>
Code dumps are articles with little or no documentation or
rearrangement of code. Please help to turn it into a literate
program. Also make sure that the source of this code does consent to
release it under the CC0 license.
</p>

<p>
This is an implementation of a Bloom filter in C.
</p>
</div>
</div>
