wiki/2016-09-13-BloomFilter–大规模数据处理利器(解决空查问题).html
<div id="outline-container-orgb954028" class="outline-3">
<h3 id="orgb954028">SOURCE</h3>
<div class="outline-text-3" id="text-orgb954028">
</div>
<div id="outline-container-org0cf4fde" class="outline-4">
<h4 id="org0cf4fde">bloom.h</h4>
<div class="outline-text-4" id="text-org0cf4fde">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">#if</span><span style="font-weight: bold;">n</span><span style="font-weight: bold;">def</span> __BLOOM_H__
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">__BLOOM_H__</span>

<span style="font-weight: bold;">#include</span><span style="font-style: italic;">&lt;stdlib.h&gt;</span>

<span style="font-weight: bold;">typedef</span> <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> (*<span style="font-weight: bold; text-decoration: underline;">hashfunc_t</span>)(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *);
<span style="font-weight: bold;">typedef</span> <span style="font-weight: bold;">struct</span> {
    <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">asize</span>;
    <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">a</span>;
    <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">nfuncs</span>;
    <span style="font-weight: bold; text-decoration: underline;">hashfunc_t</span> *<span style="font-weight: bold; font-style: italic;">funcs</span>;
} <span style="font-weight: bold; text-decoration: underline;">BLOOM</span>;

<span style="font-weight: bold; text-decoration: underline;">BLOOM</span> *<span style="font-weight: bold;">bloom_create</span>(<span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">size</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">nfuncs</span>, ...);
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">bloom_destroy</span>(<span style="font-weight: bold; text-decoration: underline;">BLOOM</span> *<span style="font-weight: bold; font-style: italic;">bloom</span>);
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">bloom_add</span>(<span style="font-weight: bold; text-decoration: underline;">BLOOM</span> *<span style="font-weight: bold; font-style: italic;">bloom</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">s</span>);
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">bloom_check</span>(<span style="font-weight: bold; text-decoration: underline;">BLOOM</span> *<span style="font-weight: bold; font-style: italic;">bloom</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">s</span>);

<span style="font-weight: bold;">#endif</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6459273" class="outline-4">
<h4 id="org6459273">bloom.c</h4>
<div class="outline-text-4" id="text-org6459273">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">#include</span><span style="font-style: italic;">&lt;limits.h&gt;</span>
<span style="font-weight: bold;">#include</span><span style="font-style: italic;">&lt;stdarg.h&gt;</span>

<span style="font-weight: bold;">#include</span><span style="font-style: italic;">"bloom.h"</span>

<span style="font-weight: bold;">#define</span> <span style="font-weight: bold;">SETBIT</span>(<span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; font-style: italic;">n</span>) (a[n/CHAR_BIT] |= (1&lt;&lt;(n%CHAR_BIT)))
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold;">GETBIT</span>(<span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; font-style: italic;">n</span>) (a[n/CHAR_BIT] &amp; (1&lt;&lt;(n%CHAR_BIT)))

<span style="font-weight: bold; text-decoration: underline;">BLOOM</span> *<span style="font-weight: bold;">bloom_create</span>(<span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">size</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">nfuncs</span>, ...)
{
    <span style="font-weight: bold; text-decoration: underline;">BLOOM</span> *<span style="font-weight: bold; font-style: italic;">bloom</span>;
    <span style="font-weight: bold; text-decoration: underline;">va_list</span> <span style="font-weight: bold; font-style: italic;">l</span>;
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">n</span>;

    <span style="font-weight: bold;">if</span>(!(bloom=malloc(<span style="font-weight: bold;">sizeof</span>(BLOOM)))) <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
    <span style="font-weight: bold;">if</span>(!(bloom-&gt;a=calloc((size+CHAR_BIT-1)/CHAR_BIT, <span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">char</span>)))) {
        free(bloom);
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
    }
    <span style="font-weight: bold;">if</span>(!(bloom-&gt;funcs=(<span style="font-weight: bold; text-decoration: underline;">hashfunc_t</span>*)malloc(<span style="font-weight: bold; text-decoration: underline;">nfuncs</span>*<span style="font-weight: bold;">sizeof</span>(hashfunc_t)))) {
        free(bloom-&gt;a);
        free(bloom);
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
    }

    va_start(l, nfuncs);
    <span style="font-weight: bold;">for</span>(n=0; n&lt;nfuncs; ++n) {
        bloom-&gt;funcs[n]=va_arg(l, hashfunc_t);
    }
    va_end(l);

    bloom-&gt;nfuncs=nfuncs;
    bloom-&gt;asize=size;

    <span style="font-weight: bold;">return</span> bloom;
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">bloom_destroy</span>(<span style="font-weight: bold; text-decoration: underline;">BLOOM</span> *<span style="font-weight: bold; font-style: italic;">bloom</span>)
{
    free(bloom-&gt;a);
    free(bloom-&gt;funcs);
    free(bloom);

    <span style="font-weight: bold;">return</span> 0;
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">bloom_add</span>(<span style="font-weight: bold; text-decoration: underline;">BLOOM</span> *<span style="font-weight: bold; font-style: italic;">bloom</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">s</span>)
{
    <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">n</span>;

    <span style="font-weight: bold;">for</span>(n=0; n&lt;bloom-&gt;nfuncs; ++n) {
        SETBIT(bloom-&gt;a, bloom-&gt;funcs[n](s)%bloom-&gt;asize);
    }

    <span style="font-weight: bold;">return</span> 0;
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">bloom_check</span>(<span style="font-weight: bold; text-decoration: underline;">BLOOM</span> *<span style="font-weight: bold; font-style: italic;">bloom</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">s</span>)
{
    <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">n</span>;

    <span style="font-weight: bold;">for</span>(n=0; n&lt;bloom-&gt;nfuncs; ++n) {
        <span style="font-weight: bold;">if</span>(!(GETBIT(bloom-&gt;a, bloom-&gt;funcs[n](s)%bloom-&gt;asize))) <span style="font-weight: bold;">return</span> 0;
    }

    <span style="font-weight: bold;">return</span> 1;
}
</pre>
</div>
</div>
</div>
