wiki/2016-09-13-BloomFilter–大规模数据处理利器(解决空查问题).html

<div id="outline-container-org06f9760" class="outline-4">
<h4 id="org06f9760">test.c</h4>
<div class="outline-text-4" id="text-org06f9760">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">#include</span><span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold;">#include</span><span style="font-style: italic;">&lt;string.h&gt;</span>

<span style="font-weight: bold;">#include</span><span style="font-style: italic;">"bloom.h"</span>

<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">sax_hash</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">key</span>)
{
    <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">h</span>=0;

    <span style="font-weight: bold;">while</span>(*key) h^=(h&lt;&lt;5)+(h&gt;&gt;2)+(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span>)*key++;

    <span style="font-weight: bold;">return</span> h;
}

<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">sdbm_hash</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">key</span>)
{
    <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">h</span>=0;
    <span style="font-weight: bold;">while</span>(*key) h=(<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">char</span>)*key++ + (h&lt;&lt;6) + (h&lt;&lt;16) - h;
    <span style="font-weight: bold;">return</span> h;
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
    <span style="font-weight: bold; text-decoration: underline;">FILE</span> *<span style="font-weight: bold; font-style: italic;">fp</span>;
    <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">line</span>[1024];
    <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">p</span>;
    <span style="font-weight: bold; text-decoration: underline;">BLOOM</span> *<span style="font-weight: bold; font-style: italic;">bloom</span>;

    <span style="font-weight: bold;">if</span>(argc&lt;2) {
        fprintf(stderr, <span style="font-style: italic;">"ERROR: No word file specified\n"</span>);
        <span style="font-weight: bold;">return</span> EXIT_FAILURE;
    }

    <span style="font-weight: bold;">if</span>(!(bloom=bloom_create(2500000, 2, sax_hash, sdbm_hash))) {
        fprintf(stderr, <span style="font-style: italic;">"ERROR: Could not create bloom filter\n"</span>);
        <span style="font-weight: bold;">return</span> EXIT_FAILURE;
    }

    <span style="font-weight: bold;">if</span>(!(fp=fopen(argv[1], <span style="font-style: italic;">"r"</span>))) {
        fprintf(stderr, <span style="font-style: italic;">"ERROR: Could not open file&#160;%s\n"</span>, argv[1]);
        <span style="font-weight: bold;">return</span> EXIT_FAILURE;
    }

    <span style="font-weight: bold;">while</span>(fgets(line, 1024, fp)) {
        <span style="font-weight: bold;">if</span>((p=strchr(line, <span style="font-style: italic;">'\r'</span>))) *p=<span style="font-style: italic;">'\0'</span>;
        <span style="font-weight: bold;">if</span>((p=strchr(line, <span style="font-style: italic;">'\n'</span>))) *p=<span style="font-style: italic;">'\0'</span>;

        bloom_add(bloom, line);
    }

    fclose(fp);

    <span style="font-weight: bold;">while</span>(fgets(line, 1024, stdin)) {
        <span style="font-weight: bold;">if</span>((p=strchr(line, <span style="font-style: italic;">'\r'</span>))) *p=<span style="font-style: italic;">'\0'</span>;
        <span style="font-weight: bold;">if</span>((p=strchr(line, <span style="font-style: italic;">'\n'</span>))) *p=<span style="font-style: italic;">'\0'</span>;

        p=strtok(line, <span style="font-style: italic;">" \t,.;:\r\n?!-/()"</span>);
        <span style="font-weight: bold;">while</span>(p) {
            <span style="font-weight: bold;">if</span>(!bloom_check(bloom, p)) {
                printf(<span style="font-style: italic;">"No match for ford \"%s\"\n"</span>, p);
            }
            p=strtok(<span style="font-weight: bold; text-decoration: underline;">NULL</span>, <span style="font-style: italic;">" \t,.;:\r\n?!-/()"</span>);
        }
    }

    bloom_destroy(bloom);

    <span style="font-weight: bold;">return</span> EXIT_SUCCESS;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf82512a" class="outline-4">
<h4 id="orgf82512a">Makefile</h4>
<div class="outline-text-4" id="text-orgf82512a">
<div class="org-src-container">
<pre class="src src-makefile"><span style="font-weight: bold;">all</span>: bloom

<span style="font-weight: bold;">bloom</span>: bloom.o test.o
    cc -o bloom -Wall -pedantic bloom.o test.o

<span style="font-weight: bold;">bloom.o</span>: bloom.c bloom.h
    cc -o bloom.o -Wall -pedantic -ansi -c bloom.c

<span style="font-weight: bold;">test.o</span>: test.c bloom.h
    cc -o test.o -Wall -pedantic -ansi -c test.c
</pre>
</div>
</div>
</div>
</div>
</div>
